; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	infrared0 - mode
	Star7 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Star8 - direction
	Star4 - direction
	Star5 - direction
	Star9 - direction
	GroundStation6 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star9)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument5 infrared0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star9)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument7 image1)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 Star8)
	(supports instrument8 infrared0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 Star9)
	(calibration_target instrument8 Star5)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
)
(:goal (and
	(pointing satellite1 Star11)
	(pointing satellite2 Star11)
	(pointing satellite3 Star4)
	(have_image Star10 image1)
	(have_image Star11 infrared0)
	(have_image Star12 image1)
	(have_image Phenomenon13 infrared0)
))

)

; plan
1. (turn_to satellite2 star11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star11)
   goals met: 1 of 7
2. (turn_to satellite1 star11 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star11)
   goals met: 2 of 7
3. (switch_on instrument3 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument3)
   goals met: 2 of 7
4. (calibrate satellite0 instrument3 groundstation6)
   added: (calibrated instrument3)
   goals met: 2 of 7
5. (turn_to satellite0 star10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star10)
   goals met: 2 of 7
6. (take_image satellite0 star10 instrument3 image1)
   added: (have_image star10 image1)
   goals met: 3 of 7
7. (turn_to satellite0 phenomenon13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 7
8. (take_image satellite0 phenomenon13 instrument3 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 4 of 7
9. (turn_to satellite0 star11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star11)
   goals met: 4 of 7
10. (take_image satellite0 star11 instrument3 infrared0)
   added: (have_image star11 infrared0)
   goals met: 5 of 7
11. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 5 of 7
12. (take_image satellite0 star12 instrument3 image1)
   added: (have_image star12 image1)
   goals met: 6 of 7
13. (turn_to satellite3 star4 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 star4)
   goals met: 7 of 7
